# Pandas Ejercicio #2 - Solucion

Importe pandas

In [1]:
import pandas as pd

Creamos por usted el siguiente dataframe

In [2]:
df = pd.DataFrame([
  ['January', 100, 100, 23, 100],
  ['February', 51, 45, 145, 45],
  ['March', 81, 96, 65, 96],
  ['April', 80, 80, 54, 180],
  ['May', 51, 54, 54, 154],
  ['June', 112, 109, 79, 129]],
  columns=['month', 'clinic_east',
           'clinic_north', 'clinic_south',
           'clinic_west']
)

df

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96
3     April           80            80            54          180
4       May           51            54            54          154
5      June          112           109            79          129

Usted quiere analizar que esta pasando con la clinica del norte. Cree una variable llamada: `clinic_north` que contenga solo los datos de la columna `clinic_north`. Llamela como indice y llamela con notacion de punto. Imprima ambas

In [5]:
clinic_north_indice = df['clinic_north']
clinic_north_indice

0    100
1     45
2     96
3     80
4     54
5    109
Name: clinic_north, dtype: int64

In [7]:
clinic_north_punto = df.clinic_north
clinic_north

0    100
1     45
2     96
3     80
4     54
5    109
Name: clinic_north, dtype: int64

Despues de crear estas variables, averigue de que tipo son con el comando `type`

In [34]:
print(type(clinic_north_indice))
print(type(clinic_north_punto))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

Ahora susted quiere comparar las visitas de la clinica norte con la del sur. Cree una variable llamada `clinic_north_south` que contenga solo las columnas `clinic_north` y `clinic_south`

In [39]:
clinic_north_south = df[['clinic_north', 'clinic_south']]
clinic_north_south

   clinic_north  clinic_south
0           100            23
1            45           145
2            96            65
3            80            54
4            54            54
5           109            79

Cuando seleccionamos multiples columnas que obtenemos, una Series o un DataFrame? Averiguelo con el metodo `type`

In [13]:
#creo df
print(type(clinic_north_south))

<class 'pandas.core.frame.DataFrame'>

Quieres ahora saber cuántas visitas tuvieron lugar en marzo del año pasado. Escriba un comando que produzca una serie compuesta por los datos de marzo de las cuatro clinicas y guárdela en la variable `march`.

In [78]:
clinic_march = df.loc[2]
print(clinic_march)
print(type(clinic_march))

month           March
clinic_east        81
clinic_north       96
clinic_south       65
clinic_west        96
Name: 2, dtype: object
<class 'pandas.core.series.Series'>

Uno de sus doctores cree que hay mas visitas a la clinica finalizando primavera. Escriba un comando que produzca un DataFrame con los datos de Abril, Mayo y Junio para todas las sedes de la clinica (filas de la 3 a la 6) y guardelas en una variable llamada `april_may_june`. Imprima el resultado

In [43]:
april_may_june = df.iloc[3:6]
april_may_june

   month  clinic_east  clinic_north  clinic_south  clinic_west
3  April           80            80            54          180
4    May           51            54            54          154
5   June          112           109            79          129

Ahora usted quire saber cuantas visitas tuvieron lugar en Enero del año pasado. Cree una variable `January` usando una sentencia logica que seleccione la fila de `df` donde el `month` es `January`. E imprima esa variable

In [47]:
january = df[(df.month == "January")]
january

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100

Usted quiere ahora ver como el numero de visitas ha cambiado entre Marzo y Abril. Cree una variable llamada `march_april` que contenga los datos desde Marzo hasta Abril. Haga esto usando dos sentencias logicas combinadas usando `|` que significa OR. Imprima la variable

In [51]:
march_april = df[(df.month == "March") | (df.month == "April")]

march_april

   month  clinic_east  clinic_north  clinic_south  clinic_west
2  March           81            96            65           96
3  April           80            80            54          180

Cree una nueva variable llamada `january_february_march` que contiene la data de Jan. Feb and Mar- Haz esto con una unica sentencia logica con el comando `isin`. Luego imprima la variable

In [54]:
january_february_march = df[df.month.isin(["January", "February", "March"])]
january_february_march

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96

Examine el siguiente codigo

In [82]:
df2 = df.iloc[[1, 3, 5]]

df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3 entries, 1 to 5
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   month         3 non-null      object
 1   clinic_east   3 non-null      int64
 2   clinic_north  3 non-null      int64
 3   clinic_south  3 non-null      int64
 4   clinic_west   3 non-null      int64
dtypes: int64(4), object(1)
memory usage: 144.0+ bytes

Ahora imprimalo

In [56]:
df2

      month  clinic_east  clinic_north  clinic_south  clinic_west
1  February           51            45           145           45
3     April           80            80            54          180
5      June          112           109            79          129

Cree un nuevo dataframe llamado `df3` reseteando los indices de `df2` (no use `inplace` o `drop`) Ha cambiado `df2` despues de que usted corrio el comando?

In [58]:
df3 = df2.reset_index()
df3

   index     month  clinic_east  clinic_north  clinic_south  clinic_west
0      1  February           51            45           145           45
1      3     April           80            80            54          180
2      5      June          112           109            79          129

In [59]:
##si cambio. Porque empieza con 0 el df

Resetee los indices de `df2` usando el keyword `drop=True`. Han cambiando los indices de `df2`. En que son diferentes ahora `df2` de `df3`?

In [62]:
df_new = df2.reset_index(drop=True)

df_new

      month  clinic_east  clinic_north  clinic_south  clinic_west
0  February           51            45           145           45
1     April           80            80            54          180
2      June          112           109            79          129

In [64]:
##No son diferente

In [83]:


df = pd.DataFrame([
    [1, 'Martillo', 0.5, 0.75],
    [2, 'Clavos', 0.10, 0.25],
    [3, 'Hombre Solo', 3.00, 5.5],
    [4, 'Lija', 2.50, 3.0]
], columns=['Poduct ID', 'Descripcion', 'Costo de Manufactura', 'Precio'])

In [84]:
df

   Poduct ID  Descripcion  Costo de Manufactura  Precio
0          1     Martillo                   0.5    0.75
1          2       Clavos                   0.1    0.25
2          3  Hombre Solo                   3.0    5.50
3          4         Lija                   2.5    3.00

In [88]:

df['Cantidad'] = [1,2,3,4]

In [89]:
df

   Poduct ID  Descripcion  Costo de Manufactura  Precio  Cantidad
0          1     Martillo                   0.5    0.75         1
1          2       Clavos                   0.1    0.25         2
2          3  Hombre Solo                   3.0    5.50         3
3          4         Lija                   2.5    3.00         4

In [92]:
#df.insert(index, column_name, list_of_values)


df.insert(2, 'OtroCantiad', [100,40,5,6])

In [93]:
df

   Poduct ID  Descripcion  OtroCantiad  Costo de Manufactura  Precio  Cantidad
0          1     Martillo          100                   0.5    0.75         1
1          2       Clavos           40                   0.1    0.25         2
2          3  Hombre Solo            5                   3.0    5.50         3
3          4         Lija            6                   2.5    3.00         4

In [94]:
df['En Inventario'] = True

In [95]:
df

,Poduct ID,Descripcion,OtroCantiad,Costo de Manufactura,Precio,Cantidad,En Inventario
0,1,Martillo,100,0.5,0.75,1,True
1,2,Clavos,40,0.1,0.25,2,True
2,3,Hombre Solo,5,3.0,5.50,3,True
3,4,Lija,6,2.5,3.00,4,True

In [96]:
df['Impuesto a las Ventas'] = df.Precio

In [97]:
df

,Poduct ID,Descripcion,OtroCantiad,Costo de Manufactura,Precio,Cantidad,En Inventario,Impuesto a las Ventas
0,1,Martillo,100,0.5,0.75,1,True,0.75
1,2,Clavos,40,0.1,0.25,2,True,0.25
2,3,Hombre Solo,5,3.0,5.50,3,True,5.50
3,4,Lija,6,2.5,3.00,4,True,3.00

In [98]:
df['Impuesto a las Ventas 2'] = df['Costo de Manufactura']

In [99]:
df

,Poduct ID,Descripcion,OtroCantiad,Costo de Manufactura,Precio,Cantidad,En Inventario,Impuesto a las Ventas,Impuesto a las Ventas 2
0,1,Martillo,100,0.5,0.75,1,True,0.75,0.5
1,2,Clavos,40,0.1,0.25,2,True,0.25,0.1
2,3,Hombre Solo,5,3.0,5.50,3,True,5.50,3.0
3,4,Lija,6,2.5,3.00,4,True,3.00,2.5

In [100]:
df['Doble Precio'] = df.Precio * 2

In [101]:
df

,Poduct ID,Descripcion,OtroCantiad,Costo de Manufactura,Precio,Cantidad,En Inventario,Impuesto a las Ventas,Impuesto a las Ventas 2,Doble Precio
0,1,Martillo,100,0.5,0.75,1,True,0.75,0.5,1.5
1,2,Clavos,40,0.1,0.25,2,True,0.25,0.1,0.5
2,3,Hombre Solo,5,3.0,5.50,3,True,5.50,3.0,11.0
3,4,Lija,6,2.5,3.00,4,True,3.00,2.5,6.0

In [102]:
df['Valor en $ en Inventario'] = df.Cantidad * df.Precio

In [103]:
df

,Poduct ID,Descripcion,OtroCantiad,Costo de Manufactura,Precio,Cantidad,En Inventario,Impuesto a las Ventas,Impuesto a las Ventas 2,Doble Precio,Valor en $ en Inventario
0,1,Martillo,100,0.5,0.75,1,True,0.75,0.5,1.5,0.75
1,2,Clavos,40,0.1,0.25,2,True,0.25,0.1,0.5,0.50
2,3,Hombre Solo,5,3.0,5.50,3,True,5.50,3.0,11.0,16.50
3,4,Lija,6,2.5,3.00,4,True,3.00,2.5,6.0,12.00

In [106]:
df.to_csv('new_df')

In [109]:

df2 = pd.DataFrame([
    [1, 'Martillo', 0.5, 0.75],
    [2, 'Clavos', 0.10, 0.25],
    [3, 'Hombre Solo', 3.00, 5.5],
    [4, 'Lija', 2.50, 3.0]
], columns=['Poduct ID', 'Descripcion', 'Costo de Manufactura', 'Precio'])

In [111]:
df2['Descripcion'] = df2['Descripcion'].str.upper()

In [112]:
df2

   Poduct ID  Descripcion  Costo de Manufactura  Precio
0          1     MARTILLO                   0.5    0.75
1          2       CLAVOS                   0.1    0.25
2          3  HOMBRE SOLO                   3.0    5.50
3          4         LIJA                   2.5    3.00